app/controllers/foods_controller.rb

  def index
    @foods = Food.all
---
SELECT "foods".* FROM "foods"

  def create
    @food = Food.new(food_params)

    respond_to do |format|
      if @food.save
---
INSERT INTO "foods" ("name", "description", "price", "photo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @food.update(food_params)
---
UPDATE "foods" SET "photo" = ?, "updated_at" = ? WHERE "foods"."id" = ?  [["photo", "JS_Menu_Bowls_Barbacoa_Market_Bowl.png"], ["updated_at", "2017-11-16 04:03:09.961422"], ["id", 25]]

    def set_food
      @food = Food.find(params[:id])
---
SELECT  "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]